PostEpi/loraTracker/STM32Cube_FW_F1_V1.4.0/Drivers/BSP/STM3210C_LoraTracker/stm3210c_loraTracker.c
/**
  ******************************************************************************
  * @file    stm3210c_eval.c
  * @author  MCD Application Team
  * @version V6.0.2
  * @date    29-April-2016
  * @brief   This file provides a set of firmware functions to manage Leds, 
  *          push-button and COM ports for STM3210C_EVAL
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm3210c_loraTracker.h"
#include "flash_if.h"

/** @addtogroup BSP
  * @{
  */

/** @defgroup STM3210C_EVAL STM3210C-EVAL
  * @{
  */

/** @defgroup STM3210C_EVAL_COMMON STM3210C-EVAL Common
  * @{
  */

/** @defgroup STM3210C_EVAL_Private_TypesDefinitions Private Types Definitions
  * @{
  */

typedef struct
{
    __IO uint16_t LCD_REG_R; /* Read Register */
    __IO uint16_t LCD_RAM_R; /* Read RAM */
    __IO uint16_t LCD_REG_W; /* Write Register */
    __IO uint16_t LCD_RAM_W; /* Write RAM */
} TFT_LCD_TypeDef;

/**
  * @}
  */

/** @defgroup STM3210C_EVAL_Private_Defines Private Defines
  * @{
  */

/* LINK LCD */
#define START_BYTE 0x70
#define SET_INDEX 0x00
#define READ_STATUS 0x01
#define LCD_WRITE_REG 0x02
#define LCD_READ_REG 0x03

/* LINK SD Card */
#define SD_DUMMY_BYTE 0xFF
#define SD_NO_RESPONSE_EXPECTED 0x80

/* Iot Tracker version number */
#define __BOOTLOADER_VERSION        (1)
#define __APPLICATION_VERSION       (4)

#if 0
__APPLICATION_VERSION: application version history.
1 : base source
2 : the codes for sk iot is added.
3 : gps tunning
#endif


/**
 * @brief STM3210C EVAL BSP Driver version number
   */
#define __STM3210C_EVAL_BSP_VERSION_MAIN (0x06) /*!< [31:24] main version */
#define __STM3210C_EVAL_BSP_VERSION_SUB1 (0x00) /*!< [23:16] sub1 version */
#define __STM3210C_EVAL_BSP_VERSION_SUB2 (0x02) /*!< [15:8]  sub2 version */
#define __STM3210C_EVAL_BSP_VERSION_RC (0x00)   /*!< [7:0]  release candidate */
#define __STM3210C_EVAL_BSP_VERSION ((__STM3210C_EVAL_BSP_VERSION_MAIN << 24) | (__STM3210C_EVAL_BSP_VERSION_SUB1 << 16) | (__STM3210C_EVAL_BSP_VERSION_SUB2 << 8) | (__STM3210C_EVAL_BSP_VERSION_RC))

/* Note: LCD /CS is CE4 - Bank 4 of NOR/SRAM Bank 1~4 */
#define TFT_LCD_BASE ((uint32_t)(0x60000000 | 0x0C000000))
#define TFT_LCD ((TFT_LCD_TypeDef *)TFT_LCD_BASE)

/**
  * @}
  */

/** @defgroup STM3210C_EVAL_Private_Variables Private Variables
  * @{
  */
/**
 * @brief LED variables
 */

#if defined(BSP_V500_TEST)
GPIO_TypeDef *LED_PORT[LEDn] = {LED1_GPIO_PORT,
                                LED2_GPIO_PORT,
                                LED3_GPIO_PORT};

const uint16_t LED_PIN[LEDn] = {LED1_PIN,
                                LED2_PIN,
                                LED3_PIN};
#else
GPIO_TypeDef *LED_PORT[LEDn] = {LED1_GPIO_PORT,
                                LED2_GPIO_PORT};

const uint16_t LED_PIN[LEDn] = {LED1_PIN,
                                LED2_PIN};
#endif

/**
 * @brief BUTTON variables
 */
GPIO_TypeDef *INPUT_PORT[INPUTn] = {FACTORY_INPUT_GPIO_PORT};

const uint16_t INPUT_PIN[INPUTn] = {FACTORY_INPUT_PIN};

const uint16_t INPUT_IRQn[INPUTn] = {FACTORY_INPUT_EXTI_IRQn};

#if 0
/**
 * @brief BUTTON variables
 */
GPIO_TypeDef *BUTTON_PORT[BUTTONn] = {WAKEUP_BUTTON_GPIO_PORT,
                                      TAMPER_BUTTON_GPIO_PORT,
                                      KEY_BUTTON_GPIO_PORT};

const uint16_t BUTTON_PIN[BUTTONn] = {WAKEUP_BUTTON_PIN,
                                      TAMPER_BUTTON_PIN,
                                      KEY_BUTTON_PIN};

const uint16_t BUTTON_IRQn[BUTTONn] = {WAKEUP_BUTTON_EXTI_IRQn,
                                       TAMPER_BUTTON_EXTI_IRQn,
                                       KEY_BUTTON_EXTI_IRQn};
#endif

#define WDI_HOLD_PIN                    GPIO_PIN_0
#define WDI_HOLD_GPIO_PORT		          GPIOC
#define WDI_HOLD_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOC_CLK_ENABLE()
#define WDI_HOLD_GPIO_CLK_DISBLE()      __HAL_RCC_GPIOC_CLK_DISABLE()

#define PS_HOLD_PIN                    	GPIO_PIN_1
#define PS_HOLD_GPIO_PORT              	GPIOC
#define PS_HOLD_GPIO_CLK_ENABLE()    		__HAL_RCC_GPIOC_CLK_ENABLE()
#define PS_HOLD_GPIO_CLK_DISABLE()    	__HAL_RCC_GPIOC_CLK_DISABLE()

#define WDE_PIN                    			GPIO_PIN_13
#define WDE_GPIO_PORT              			GPIOB
#define WDE_GPIO_CLK_ENABLE()    			  __HAL_RCC_GPIOB_CLK_ENABLE()
#define WDE_GPIO_CLK_DISABLE()    		  __HAL_RCC_GPIOB_CLK_DISABLE()

#define GPS_POWER_EN_PIN             		GPIO_PIN_1
#define GPS_POWER_EN_GPIO_PORT       		GPIOB
#define GPS_POWER_EN_CLK_ENABLE()  		  __HAL_RCC_GPIOB_CLK_ENABLE()
#define GPS_POWER_EN_CLK_DISABLE()  	  __HAL_RCC_GPIOB_CLK_DISABLE()

#define LORA_POWER_EN_PIN             	GPIO_PIN_3
#define LORA_POWER_EN_GPIO_PORT       	GPIOC
#define LORA_POWER_EN_CLK_ENABLE()  		__HAL_RCC_GPIOB_CLK_ENABLE()
#define LORA_POWER_EN_CLK_DISABLE()  		__HAL_RCC_GPIOB_CLK_DISABLE()

#define LORA_RESET_EN_PIN             	GPIO_PIN_2
#define LORA_RESET_EN_GPIO_PORT       	GPIOC
#define LORA_RESET_EN_CLK_ENABLE()  		__HAL_RCC_GPIOB_CLK_ENABLE()
#define LORA_RESET_EN_CLK_DISABLE()  		__HAL_RCC_GPIOB_CLK_DISABLE()

