PostEpi/loraTracker/STM32Cube_FW_F1_V1.4.0/Drivers/BSP/STM3210C_LoraTracker/stm3210c_loraTracker.c
    return false;
}

bool BSP_BootSignatureHash(uint32_t offset, uint8_t *hash, uint32_t size)
{
    uint32_t addr = APPLICATION_ADDRESS + offset - APPLICATION_SIGNATURE_DOWNLOAD_HEAD - BOOT_SIGNATURE_SIZE;

    if(addr > ADDR_FLASH_PAGE_127)
    {
        return false;
    }

    /*copy from flash to ram */
    for (; size > 0; size -= 1, addr += 1, hash++) {
        *hash = *(uint8_t *) addr;
    }
    
    return true;
}

void BSP_BootSignature( BootSig *boot)
{
    int i;
    int spFlash[10];
    uint32_t Address = SP_FLASH_START_ADDRESS;

    int bootSigSize = sizeof(BootSig)/sizeof(int);
    for(int i = 0 ; i < bootSigSize ; i++, Address+=4)
    {
        spFlash[i] = *(__IO uint32_t *)Address;
    }
    boot->signature = spFlash[0];
    boot->lengthofapplication = spFlash[1];
}

void BSP_Application_Signature(int value)
{
    applicationSignatureOffset = value;
}

void BSP_Download_Reset(void)
{
    __IO uint32_t FLASHStatus = FLASHIF_OK;
    uint32_t Address = SP_FLASH_START_ADDRESS;
    uint32_t signature = SIGNAUTURE_EMERGENCE;

    int retry = 3;
    BootSig bootsig;

    BSP_BootSignature(&bootsig);
    bootsig.signature = SIGNAUTURE_EMERGENCE;
    
    /* Unlock the Program memory */
    HAL_FLASH_Unlock();

    /* Clear all FLASH flags */
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPERR);

    /* Unlock the Program memory */
    HAL_FLASH_Lock();
    
    FLASHStatus = FLASH_If_GPS_Erase_Page(Address);
    if (FLASHStatus != FLASHIF_OK)
    {
        printf("  the erase process is failed...\r\n");
    }
    else
    {
      while(retry--) {
        //FLASHStatus = FLASH_If_Write(Address, &signature, 1);
        //FLASHStatus = FLASH_If_Write(Address, &signature, 1);
        FLASHStatus = FLASH_If_Write(Address, (uint32_t *)&bootsig,  sizeof(BootSig)/sizeof(int));

        if (FLASHStatus == FLASHIF_OK)
        {
            HAL_NVIC_SystemReset();
        }
        else
        {
            /* Unlock the Program memory */
            HAL_FLASH_Unlock();
            
            __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPERR);
            
            /* Unlock the Program memory */
            HAL_FLASH_Lock();
          
        }
      }   
        
    }
}

void BSP_Booting_Reset(void)
{
    __IO uint32_t FLASHStatus = FLASHIF_OK;
    uint32_t Address = SP_FLASH_START_ADDRESS;
    int signature = 0;
    int retry = 3;
    
    BootSig bootsig;
    
    BSP_BootSignature(&bootsig);
    bootsig.signature = 0;

    if(applicationSignatureOffset != 0) 
    {
        bootsig.lengthofapplication = applicationSignatureOffset;
        applicationSignatureOffset = 0;
    }

    /* Unlock the Program memory */
    HAL_FLASH_Unlock();

    /* Clear all FLASH flags */
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPERR);

    /* Unlock the Program memory */
    HAL_FLASH_Lock();
    
    FLASHStatus = FLASH_If_GPS_Erase_Page(Address);
    if (FLASHStatus != FLASHIF_OK)
    {
        printf("  the erase process is failed...\r\n");
    }
    else
    {
      while(retry--) {
        //FLASHStatus = FLASH_If_Write(Address, &signature, 1);
        FLASHStatus = FLASH_If_Write(Address, (uint32_t *)&bootsig,  sizeof(BootSig)/sizeof(int));
        if (FLASHStatus == FLASHIF_OK)
        {
            HAL_NVIC_SystemReset();
        }
        else
        {
            /* Unlock the Program memory */
            HAL_FLASH_Unlock();
            
            __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPERR);
            
            /* Unlock the Program memory */
            HAL_FLASH_Lock();
          
        }
      }   
        
    }
}

void BSP_Appcation_Format(void)
{
    __IO uint32_t FLASHStatus = FLASHIF_OK;
    uint32_t Address = APPLICATION_ADDRESS;

    /* Unlock the Program memory */
    HAL_FLASH_Unlock();

    /* Clear all FLASH flags */
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPERR);

    /* Unlock the Program memory */
    HAL_FLASH_Lock();
    
    FLASHStatus = FLASH_If_Erase(Address);
    if (FLASHStatus != FLASHIF_OK)
    {
        printf("  the erase process is failed...\r\n");
    }
    else
    {
    }
}


void BSP_HW_Reset(void)
{
    BSP_OUTGPIO_High(OUTPUT_PRST);
    BSP_Lora_HW_Reset();
    HAL_NVIC_SystemReset();  
}

void BSP_Delay_HW_Reset(void)
{
    HAL_Delay(5000);
    BSP_HW_Reset();
}

void BSP_Lora_HW_Reset(void)
{
    BSP_OUTGPIO_Low(OUTPUT_NRST);
    HAL_Delay(10);
    BSP_OUTGPIO_High(OUTPUT_NRST);
}

void BSP_Lora_Wakeup(void)
{
    BSP_OUTGPIO_High(OUTPUT_WKUP);
    HAL_Delay(2);
    BSP_OUTGPIO_Low(OUTPUT_WKUP);
}



/**
  * @brief  Configures Outpu GPIO.
  * @param  Out: Specifies the output to be configured. 
  *   This parameter can be one of following parameters:
  * @retval None
  */
void BSP_OUTGPIO_init(Output_TypeDef Outpin, GPIO_PinState initialstatus)
{
    GPIO_InitTypeDef gpioinitstruct = {0};

    /* Enable the corresponding Push Button clock */
    OUTPUTx_GPIO_CLK_ENABLE(Outpin);

    /* Configure Push Button pin as input */
    gpioinitstruct.Pin = OUTPUT_PIN[Outpin];
    gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;
    gpioinitstruct.Mode = GPIO_MODE_OUTPUT_PP;
    HAL_GPIO_Init(OUTPUT_PORT[Outpin], &gpioinitstruct);

    HAL_GPIO_WritePin(OUTPUT_PORT[Outpin], OUTPUT_PIN[Outpin], initialstatus);
}

void BSP_OUTGPIO_Low(Output_TypeDef Outpin)
{
    HAL_GPIO_WritePin(OUTPUT_PORT[Outpin], OUTPUT_PIN[Outpin], GPIO_PIN_RESET);
}

void BSP_OUTGPIO_High(Output_TypeDef Outpin)
{
    HAL_GPIO_WritePin(OUTPUT_PORT[Outpin], OUTPUT_PIN[Outpin], GPIO_PIN_SET);
}


    /**
  * @brief  Configures push input GPIO and EXTI Line.
  * @param  input: input to be configured.
  *   This parameter can be one of the following values: 
  *     @arg INPUT_FACTORY: factory input 
  * @param  Input_Mode: Input mode requested.
  *   This parameter can be one of the following values:   
  *     @arg INTPUT_MODE_GPIO: Input will be used as simple IO 
  *     @arg INTPUT_MODE_EXTI: Input will be connected to EXTI line
  *                            with interrupt generation capability
  * @retval None
  */
void BSP_Input_Init(Input_TypeDef InputPin, InputMode_TypeDef Input_Mode)
{
    GPIO_InitTypeDef gpioinitstruct = {0};

