PostEpi/loraTracker/STM32Cube_FW_F1_V1.4.0/Drivers/BSP/STM3210C_LoraTracker/stm3210c_loraTracker.c
    /* Enable the corresponding input Pin clock */
    INPUTx_GPIO_CLK_ENABLE(InputPin);

    /* Configure Push input pin as input */
    gpioinitstruct.Pin = INPUT_PIN[InputPin];
    gpioinitstruct.Pull = GPIO_NOPULL;
    gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;

    if (Input_Mode == INPUT_MODE_GPIO)
    {
        /* Configure input pin as input */
        gpioinitstruct.Mode = GPIO_MODE_INPUT;
        HAL_GPIO_Init(INPUT_PORT[InputPin], &gpioinitstruct);
    }
    else if (Input_Mode == INPUT_MODE_EXTI)
    {
        if (InputPin != INPUT_FACTORY)
        {
            /* Configure Joystick input pin as input with External interrupt, falling edge */
            gpioinitstruct.Mode = GPIO_MODE_IT_FALLING;
        }
        else
        {
            /* Configure Key Push input pin as input with External interrupt, rising edge */
            gpioinitstruct.Mode = GPIO_MODE_IT_RISING;
        }
        HAL_GPIO_Init(INPUT_PORT[InputPin], &gpioinitstruct);

        /* Enable and set input EXTI Interrupt to the lowest priority */
        HAL_NVIC_SetPriority((IRQn_Type)(INPUT_IRQn[InputPin]), 0x0F, 0);
        HAL_NVIC_EnableIRQ((IRQn_Type)(INPUT_IRQn[InputPin]));
    }
}

/**
  * @brief  Returns the selected input state.
  * @param  input: input to be checked.
  *   This parameter can be one of the following values:
  *     @arg BUTTON_TAMPER: Key/Tamper Push Button 
  * @retval input state
  */
uint32_t BSP_Input_GetState(Input_TypeDef Input)
{
    return HAL_GPIO_ReadPin(INPUT_PORT[Input], INPUT_PIN[Input]);
}

#if 0
    /**
  * @brief  Configures push button GPIO and EXTI Line.
  * @param  Button: Button to be configured.
  *   This parameter can be one of the following values: 
  *     @arg BUTTON_WAKEUP: Wakeup Push Button 
  *     @arg BUTTON_TAMPER: Tamper Push Button 
  *     @arg BUTTON_KEY: Key Push Button 
  * @param  Button_Mode: Button mode requested.
  *   This parameter can be one of the following values:   
  *     @arg BUTTON_MODE_GPIO: Button will be used as simple IO 
  *     @arg BUTTON_MODE_EXTI: Button will be connected to EXTI line
  *                            with interrupt generation capability
  * @retval None
  */
void BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef Button_Mode)
{
    GPIO_InitTypeDef gpioinitstruct = {0};

    /* Enable the corresponding Push Button clock */
    BUTTONx_GPIO_CLK_ENABLE(Button);

    /* Configure Push Button pin as input */
    gpioinitstruct.Pin = BUTTON_PIN[Button];
    gpioinitstruct.Pull = GPIO_NOPULL;
    gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;

    if (Button_Mode == BUTTON_MODE_GPIO)
    {
        /* Configure Button pin as input */
        gpioinitstruct.Mode = GPIO_MODE_INPUT;
        HAL_GPIO_Init(BUTTON_PORT[Button], &gpioinitstruct);
    }
    else if (Button_Mode == BUTTON_MODE_EXTI)
    {
        if (Button != BUTTON_WAKEUP)
        {
            /* Configure Joystick Button pin as input with External interrupt, falling edge */
            gpioinitstruct.Mode = GPIO_MODE_IT_FALLING;
        }
        else
        {
            /* Configure Key Push Button pin as input with External interrupt, rising edge */
            gpioinitstruct.Mode = GPIO_MODE_IT_RISING;
        }
        HAL_GPIO_Init(BUTTON_PORT[Button], &gpioinitstruct);

        /* Enable and set Button EXTI Interrupt to the lowest priority */
        HAL_NVIC_SetPriority((IRQn_Type)(BUTTON_IRQn[Button]), 0x0F, 0);
        HAL_NVIC_EnableIRQ((IRQn_Type)(BUTTON_IRQn[Button]));
    }
}

/**
  * @brief  Returns the selected button state.
  * @param  Button: Button to be checked.
  *   This parameter can be one of the following values:
  *     @arg BUTTON_TAMPER: Key/Tamper Push Button 
  * @retval Button state
  */
uint32_t BSP_PB_GetState(Button_TypeDef Button)
{
    return HAL_GPIO_ReadPin(BUTTON_PORT[Button], BUTTON_PIN[Button]);
}
#endif

#ifdef HAL_I2C_MODULE_ENABLED
#if 0
/**
  * @brief  Configures joystick GPIO and EXTI modes.
  * @param  Joy_Mode: Button mode.
  *          This parameter can be one of the following values:
  *            @arg  JOY_MODE_GPIO: Joystick pins will be used as simple IOs
  *            @arg  JOY_MODE_EXTI: Joystick pins will be connected to EXTI line 
  *                                 with interrupt generation capability  
  * @retval IO_OK: if all initializations are OK. Other value if error.
  */
uint8_t BSP_JOY_Init(JOYMode_TypeDef Joy_Mode)
{
    uint8_t ret = 0;

    /* Initialize the IO functionalities */
    ret = BSP_IO_Init();

    /* Configure joystick pins in IT mode */
    if ((ret == IO_OK) && (Joy_Mode == JOY_MODE_EXTI))
    {
        /* Configure joystick pins in IT mode */
        BSP_IO_ConfigPin(JOY_ALL_PINS, IO_MODE_IT_FALLING_EDGE);
    }

    return ret;
}

/**
  * @brief  Returns the current joystick status.
  * @retval Code of the joystick key pressed
  *          This code can be one of the following values:
  *            @arg  JOY_NONE
  *            @arg  JOY_SEL
  *            @arg  JOY_DOWN
  *            @arg  JOY_LEFT
  *            @arg  JOY_RIGHT
  *            @arg  JOY_UP
  */
JOYState_TypeDef BSP_JOY_GetState(void)
{
    uint32_t tmp = 0;

    /* Read the status joystick pins */
    tmp = BSP_IO_ReadPin(JOY_ALL_PINS);

    /* Check the pressed keys */
    if ((tmp & JOY_NONE_PIN) == JOY_NONE)
    {
        return (JOYState_TypeDef)JOY_NONE;
    }
    else if (!(tmp & JOY_SEL_PIN))
    {
        return (JOYState_TypeDef)JOY_SEL;
    }
    else if (!(tmp & JOY_DOWN_PIN))
    {
        return (JOYState_TypeDef)JOY_DOWN;
    }
    else if (!(tmp & JOY_LEFT_PIN))
    {
        return (JOYState_TypeDef)JOY_LEFT;
    }
    else if (!(tmp & JOY_RIGHT_PIN))
    {
        return (JOYState_TypeDef)JOY_RIGHT;
    }
    else if (!(tmp & JOY_UP_PIN))
    {
        return (JOYState_TypeDef)JOY_UP;
    }
    else
    {
        return (JOYState_TypeDef)JOY_NONE;
    }
}
#endif

#endif /*HAL_I2C_MODULE_ENABLED*/

#ifdef HAL_UART_MODULE_ENABLED
/**
  * @brief  Configures COM port.
  * @param  COM: Specifies the COM port to be configured.
  *   This parameter can be one of following parameters:    
  *     @arg COM1
  * @param  huart: pointer to a UART_HandleTypeDef structure that
  *   contains the configuration information for the specified UART peripheral.
  * @retval None
  */
void BSP_COM_Init(COM_TypeDef COM, UART_HandleTypeDef *huart)
{
    GPIO_InitTypeDef gpioinitstruct = {0};

