PostEpi/loraTracker/STM32Cube_FW_F1_V1.4.0/Drivers/BSP/STM3210C_LoraTracker/stm3210c_loraTracker.c
    /* Enable GPIO clock */
    COMx_TX_GPIO_CLK_ENABLE(COM);
    COMx_RX_GPIO_CLK_ENABLE(COM);

    /* Enable USART clock */
    COMx_CLK_ENABLE(COM);

    /* Remap AFIO if needed */
    AFIOCOMx_CLK_ENABLE(COM);
    AFIOCOMx_REMAP(COM);

    /* Configure USART Tx as alternate function push-pull */
    gpioinitstruct.Pin = COM_TX_PIN[COM];
    gpioinitstruct.Mode = GPIO_MODE_AF_PP;
    gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;
    gpioinitstruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(COM_TX_PORT[COM], &gpioinitstruct);

    /* Configure USART Rx as alternate function push-pull */
    gpioinitstruct.Mode = GPIO_MODE_INPUT;
    gpioinitstruct.Pin = COM_RX_PIN[COM];
    HAL_GPIO_Init(COM_RX_PORT[COM], &gpioinitstruct);

    /* USART configuration */
    huart->Instance = COM_USART[COM];
    HAL_UART_Init(huart);
}
#endif /* HAL_UART_MODULE_ENABLED */

/**
  * @}
  */

/** @defgroup STM3210C_EVAL_BusOperations_Functions Bus Operations Functions
  * @{
  */

/*******************************************************************************
                            BUS OPERATIONS
*******************************************************************************/

#ifdef HAL_I2C_MODULE_ENABLED
/******************************* I2C Routines**********************************/

/**
  * @brief Eval I2Cx MSP Initialization
  * @param hi2c: I2C handle
  * @retval None
  */
static void I2Cx_MspInit(I2C_HandleTypeDef *hi2c)
{
    GPIO_InitTypeDef gpioinitstruct = {0};

    if (hi2c->Instance == EVAL_I2Cx)
    {
        /*## Configure the GPIOs ################################################*/

        /* Enable GPIO clock */
        EVAL_I2Cx_SDA_GPIO_CLK_ENABLE();
        EVAL_I2Cx_SCL_GPIO_CLK_ENABLE();

        /* Configure I2C Tx as alternate function  */
        gpioinitstruct.Pin = EVAL_I2Cx_SCL_PIN;
        gpioinitstruct.Mode = GPIO_MODE_AF_OD;
        gpioinitstruct.Pull = GPIO_NOPULL;
        gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(EVAL_I2Cx_SCL_GPIO_PORT, &gpioinitstruct);

        /* Configure I2C Rx as alternate function  */
        gpioinitstruct.Pin = EVAL_I2Cx_SDA_PIN;
        HAL_GPIO_Init(EVAL_I2Cx_SDA_GPIO_PORT, &gpioinitstruct);

        /*## Configure the Eval I2Cx peripheral #######################################*/
        /* Enable Eval_I2Cx clock */
        EVAL_I2Cx_CLK_ENABLE();

        /* Add delay related to RCC workaround */
        while (READ_BIT(RCC->APB1ENR, RCC_APB1ENR_I2C1EN) != RCC_APB1ENR_I2C1EN)
        {
        };

        /* Force the I2C Periheral Clock Reset */
        EVAL_I2Cx_FORCE_RESET();

        /* Release the I2C Periheral Clock Reset */
        EVAL_I2Cx_RELEASE_RESET();

        /* Enable and set Eval I2Cx Interrupt to the highest priority */
        HAL_NVIC_SetPriority(EVAL_I2Cx_EV_IRQn, 0xE, 0);
        HAL_NVIC_EnableIRQ(EVAL_I2Cx_EV_IRQn);

        /* Enable and set Eval I2Cx Interrupt to the highest priority */
        HAL_NVIC_SetPriority(EVAL_I2Cx_ER_IRQn, 0xE, 0);
        HAL_NVIC_EnableIRQ(EVAL_I2Cx_ER_IRQn);
    }
}

/**
  * @brief Eval I2Cx Bus initialization
  * @retval None
  */
static void I2Cx_Init(void)
{
    if (HAL_I2C_GetState(&heval_I2c) == HAL_I2C_STATE_RESET)
    {
        heval_I2c.Instance = EVAL_I2Cx;
        heval_I2c.Init.ClockSpeed = BSP_I2C_SPEED;
        heval_I2c.Init.DutyCycle = I2C_DUTYCYCLE_2;
        heval_I2c.Init.OwnAddress1 = 0;
        heval_I2c.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
        heval_I2c.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
        heval_I2c.Init.OwnAddress2 = 0;
        heval_I2c.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
        heval_I2c.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;

        /* Init the I2C */
        I2Cx_MspInit(&heval_I2c);
        HAL_I2C_Init(&heval_I2c);
    }
}

/**
  * @brief  Configures I2C Interrupt.
  * @retval None
  */
static void I2Cx_ITConfig(void)
{
    static uint8_t I2C_IT_Enabled = 0;
    GPIO_InitTypeDef gpioinitstruct = {0};

    if (I2C_IT_Enabled == 0)
    {
        I2C_IT_Enabled = 1;

        /* Enable the GPIO EXTI clock */
        IOE_IT_GPIO_CLK_ENABLE();

        gpioinitstruct.Pin = IOE_IT_PIN;
        gpioinitstruct.Pull = GPIO_NOPULL;
        gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;
        gpioinitstruct.Mode = GPIO_MODE_IT_FALLING;
        HAL_GPIO_Init(IOE_IT_GPIO_PORT, &gpioinitstruct);

        /* Set priority and Enable GPIO EXTI Interrupt */
        HAL_NVIC_SetPriority((IRQn_Type)(IOE_IT_EXTI_IRQn), 0xE, 0);
        HAL_NVIC_EnableIRQ((IRQn_Type)(IOE_IT_EXTI_IRQn));
    }
}

/**
  * @brief  Reads multiple data.
  * @param  Addr: I2C address
  * @param  Reg: Reg address 
  * @param  MemAddress: Internal memory address
  * @param  Buffer: Pointer to data buffer
  * @param  Length: Length of the data
  * @retval Number of read data
  */
static HAL_StatusTypeDef I2Cx_ReadMultiple(uint8_t Addr, uint16_t Reg, uint16_t MemAddress, uint8_t *Buffer, uint16_t Length)
{
    HAL_StatusTypeDef status = HAL_OK;

    status = HAL_I2C_Mem_Read(&heval_I2c, Addr, (uint16_t)Reg, MemAddress, Buffer, Length, I2cxTimeout);

    /* Check the communication status */
    if (status != HAL_OK)
    {
        /* I2C error occured */
        I2Cx_Error(Addr);
    }
    return status;
}

/**
  * @brief  Write a value in a register of the device through BUS.
  * @param  Addr: Device address on BUS Bus.  
  * @param  Reg: The target register address to write
  * @param  Value: The target register value to be written 
  * @retval  None
  */
static void I2Cx_WriteData(uint16_t Addr, uint8_t Reg, uint8_t Value)
{
    HAL_StatusTypeDef status = HAL_OK;

    status = HAL_I2C_Mem_Write(&heval_I2c, Addr, (uint16_t)Reg, I2C_MEMADD_SIZE_8BIT, &Value, 1, I2cxTimeout);

    /* Check the communication status */
    if (status != HAL_OK)
    {
        /* Execute user timeout callback */
        I2Cx_Error(Addr);
    }
}

/**
  * @brief  Write a value in a register of the device through BUS.
  * @param  Addr: Device address on BUS Bus.  
  * @param  Reg: The target register address to write
  * @param  RegSize: The target register size (can be 8BIT or 16BIT)
  * @param  pBuffer: The target register value to be written 
  * @param  Length: buffer size to be written
  * @retval None
  */
static HAL_StatusTypeDef I2Cx_WriteBuffer(uint16_t Addr, uint8_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length)
{
    HAL_StatusTypeDef status = HAL_OK;

