PostEpi/loraTracker/STM32Cube_FW_F1_V1.4.0/Drivers/BSP/STM3210C_LoraTracker/stm3210c_loraTracker.c
#endif /* HAL_I2C_MODULE_ENABLED */

#ifdef HAL_SPI_MODULE_ENABLED
/********************************* LINK LCD ***********************************/

/**
  * @brief  Configures the LCD_SPI interface.
  * @retval None
  */
void LCD_IO_Init(void)
{
    GPIO_InitTypeDef gpioinitstruct;

    /* Configure the LCD Control pins ------------------------------------------*/
    LCD_NCS_GPIO_CLK_ENABLE();

    /* Configure NCS in Output Push-Pull mode */
    gpioinitstruct.Pin = LCD_NCS_PIN;
    gpioinitstruct.Mode = GPIO_MODE_OUTPUT_PP;
    gpioinitstruct.Pull = GPIO_NOPULL;
    gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(LCD_NCS_GPIO_PORT, &gpioinitstruct);

    /* Set or Reset the control line */
    LCD_CS_LOW();
    LCD_CS_HIGH();

    SPIx_Init();
}

/**
  * @brief  Write register value.
  * @param  pData Pointer on the register value
  * @param  Size Size of byte to transmit to the register
  * @retval None
  */
void LCD_IO_WriteMultipleData(uint8_t *pData, uint32_t Size)
{
    uint32_t counter = 0;

    /* Reset LCD control line(/CS) and Send data */
    LCD_CS_LOW();

    /* Send Start Byte */
    SPIx_Write(START_BYTE | LCD_WRITE_REG);

    for (counter = Size; counter != 0; counter--)
    {
        while (((heval_Spi.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
        {
        }
        /* Need to invert bytes for LCD*/
        *((__IO uint8_t *)&heval_Spi.Instance->DR) = *(pData + 1);

        while (((heval_Spi.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
        {
        }
        *((__IO uint8_t *)&heval_Spi.Instance->DR) = *pData;
        counter--;
        pData += 2;
    }

    /* Wait until the bus is ready before releasing Chip select */
    while (((heval_Spi.Instance->SR) & SPI_FLAG_BSY) != RESET)
    {
    }

    /* Reset LCD control line(/CS) and Send data */
    LCD_CS_HIGH();
}

/**
  * @brief  register address.
  * @param  Reg
  * @retval None
  */
void LCD_IO_WriteReg(uint8_t Reg)
{
    /* Reset LCD control line(/CS) and Send command */
    LCD_CS_LOW();

    /* Send Start Byte */
    SPIx_Write(START_BYTE | SET_INDEX);

    /* Write 16-bit Reg Index (High Byte is 0) */
    SPIx_Write(0x00);
    SPIx_Write(Reg);

    /* Deselect : Chip Select high */
    LCD_CS_HIGH();
}

/**
  * @brief  Read register value.
  * @param  Reg
  * @retval None
  */
uint16_t LCD_IO_ReadData(uint16_t Reg)
{
    uint32_t readvalue = 0;

    /* Send Reg value to Read */
    LCD_IO_WriteReg(Reg);

    /* Reset LCD control line(/CS) and Send command */
    LCD_CS_LOW();

    /* Send Start Byte */
    SPIx_Write(START_BYTE | LCD_READ_REG);
    /* Read Upper Byte */
    SPIx_Write(0xFF);
    readvalue = SPIx_Read();
    readvalue = readvalue << 8;
    readvalue |= SPIx_Read();

    HAL_Delay(10);

    /* Deselect : Chip Select high */
    LCD_CS_HIGH();
    return readvalue;
}

/**
  * @brief  Wait for loop in ms.
  * @param  Delay in ms.
  * @retval None
  */
void LCD_Delay(uint32_t Delay)
{
    HAL_Delay(Delay);
}

/******************************** LINK SD Card ********************************/

/**
  * @brief  Initializes the SD Card and put it into StandBy State (Ready for 
  *         data transfer).
  * @retval None
  */
void SD_IO_Init(void)
{
    GPIO_InitTypeDef gpioinitstruct;
    uint8_t counter;

    /* SD_CS_GPIO and SD_DETECT_GPIO Periph clock enable */
    SD_CS_GPIO_CLK_ENABLE();
    SD_DETECT_GPIO_CLK_ENABLE();

    /* Configure SD_CS_PIN pin: SD Card CS pin */
    gpioinitstruct.Pin = SD_CS_PIN;
    gpioinitstruct.Mode = GPIO_MODE_OUTPUT_PP;
    gpioinitstruct.Pull = GPIO_PULLUP;
    gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(SD_CS_GPIO_PORT, &gpioinitstruct);

    /* Configure SD_DETECT_PIN pin: SD Card detect pin */
    gpioinitstruct.Pin = SD_DETECT_PIN;
    gpioinitstruct.Mode = GPIO_MODE_IT_RISING_FALLING;
    gpioinitstruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(SD_DETECT_GPIO_PORT, &gpioinitstruct);

    /* Enable and set SD EXTI Interrupt to the lowest priority */
    HAL_NVIC_SetPriority(SD_DETECT_EXTI_IRQn, 0x0F, 0);
    HAL_NVIC_EnableIRQ(SD_DETECT_EXTI_IRQn);

    /*------------Put SD in SPI mode--------------*/
    /* SD SPI Config */
    SPIx_Init();

    /* SD chip select high */
    SD_CS_HIGH();

    /* Send dummy byte 0xFF, 10 times with CS high */
    /* Rise CS and MOSI for 80 clocks cycles */
    for (counter = 0; counter <= 9; counter++)
    {
        /* Send dummy byte 0xFF */
        SD_IO_WriteByte(SD_DUMMY_BYTE);
    }
}

/**
  * @brief  Write a byte on the SD.
  * @param  Data: byte to send.
  * @retval None
  */
void SD_IO_WriteByte(uint8_t Data)
{
    /* Send the byte */
    SPIx_Write(Data);
}

/**
  * @brief  Read a byte from the SD.
  * @retval The received byte.
  */
uint8_t SD_IO_ReadByte(void)
{
    uint8_t data = 0;

    /* Get the received data */
    data = SPIx_Read();

    /* Return the shifted data */
    return data;
}

/**
  * @brief  Send 5 bytes command to the SD card and get response
  * @param  Cmd: The user expected command to send to SD card.
  * @param  Arg: The command argument.
  * @param  Crc: The CRC.
  * @param  Response: Expected response from the SD card
  * @retval  HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef SD_IO_WriteCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Response)
{
    uint32_t counter = 0x00;
    uint8_t frame[6];

    /* Prepare Frame to send */
    frame[0] = (Cmd | 0x40);         /* Construct byte 1 */
    frame[1] = (uint8_t)(Arg >> 24); /* Construct byte 2 */
    frame[2] = (uint8_t)(Arg >> 16); /* Construct byte 3 */
    frame[3] = (uint8_t)(Arg >> 8);  /* Construct byte 4 */
    frame[4] = (uint8_t)(Arg);       /* Construct byte 5 */
    frame[5] = (Crc);                /* Construct CRC: byte 6 */

    /* SD chip select low */
    SD_CS_LOW();

    /* Send Frame */
    for (counter = 0; counter < 6; counter++)
    {
        SD_IO_WriteByte(frame[counter]); /* Send the Cmd bytes */
    }

    if (Response != SD_NO_RESPONSE_EXPECTED)
    {
        return SD_IO_WaitResponse(Response);
    }

    return HAL_OK;
}

/**
  * @brief  Wait response from the SD card
  * @param  Response: Expected response from the SD card
  * @retval  HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef SD_IO_WaitResponse(uint8_t Response)
{
    uint32_t timeout = 0xFFFF;
    uint8_t resp = 0;
    /* Check if response is got or a timeout is happen */
    resp = SD_IO_ReadByte();
    while ((resp != Response) && timeout)
    {
        timeout--;
        resp = SD_IO_ReadByte();
    }

    if (timeout == 0)
    {
        /* After time out */
        return HAL_TIMEOUT;
    }
    else
    {
        /* Right response got */
        return HAL_OK;
    }
}

/**
  * @brief  Send dummy byte with CS High
  * @retval None
  */
void SD_IO_WriteDummy(void)
{
    /* SD chip select high */
    SD_CS_HIGH();

